Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་གཟུང་བའི་ཕྱིར་རམ། མི་གཟུང་བའི་ཕྱིར་སྤྱོད་པ་དང་མངོན་པར་ཤེས་པ་དང་ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་མི་འཇིགས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་གཟུང་བའི་ཕྱིར་རམ་མི་གཟུང་བའི་ཕྱིར་སྤྱོད་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་གཟུང་བའི་ཕྱིར་རམ་མི་གཟུང་བའི་ཕྱིར་སྤྱོད་པ་དེ་དག་གིས་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པར་མི་ནུས་སོ།
en: Divine princes, those who practice order that they might grasp or not grasp physical forms; those who practice in order that they might grasp or not grasp feelings, perceptions, formative predispositions, and consciousness; those who practice in order that they might grasp or not grasp the sense fields, sensory elements, and links of dependent origination; those who practice in order that they might grasp or not grasp all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment; those who practice in order that they might grasp or not grasp the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, and wishlessness; those who practice in order that they might grasp or not grasp the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas; and those who practice in order that they might grasp or not grasp [the goals], up to and including all-aspect omniscience, cannot cultivate the perfection of generosity.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པར་མི་ནུས་སོ།
en: They cannot cultivate the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: །ནང་སྟོང་པ་ཉིད་བསྒོམ་པར་མི་ནུས་སོ།
en: They cannot cultivate the emptiness of internal phenomena.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་བསྒོམ་པར་མི་ནུས་སོ།
en: They cannot cultivate [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་བསྒོམ་པར་མི་ནུས་སོ།
en: They cannot cultivate the applications of mindfulness.

source: །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་བསྒོམ་པར་མི་ནུས་སོ།
en: They cannot cultivate the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, or the noble eightfold path.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་བསྒོམ་པར་མི་ནུས་སོ།
en: They cannot cultivate [the fruitional attributes and goals], up to and including all-aspect omniscience.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་འདི་ནི་ཆོས་ཐམས་ཅད་དང་རྗེས་སུ་མཐུན་པ་སྟེ་ཆོས་འདི་ནི་ཆོས་གང་རྣམས་དང་རྗེས་སུ་འཐུན་པ་ལགས་ཤེ་ན།
en: Then, the venerable Subhūti said to the Blessed One, “Blessed Lord, this Dharma is compatible with all phenomena.

source: ཆོས་འདི་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་རྗེས་སུ་འཐུན་པའོ།
en: If one were to ask what phenomena this Dharma is compatible with, this Dharma is compatible with the perfection of wisdom.

source: །ཆོས་འདི་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་རྗེས་སུ་འཐུན་པའོ།
en: This Dharma is compatible with the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity.

source: །ཆོས་འདི་ནི་ནང་སྟོང་པ་ཉིད་དང་རྗེས་སུ་འཐུན་པའོ།
en: This Dharma is compatible with the emptiness of internal phenomena.

source: །ཆོས་འདི་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་རྗེས་སུ་འཐུན་པའོ།
en: This Dharma is compatible with [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །ཆོས་འདི་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་རྗེས་སུ་མཐུན་པའོ།
en: This Dharma is compatible with the applications of mindfulness.

source: །ཆོས་འདི་ནི་ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་རྗེས་སུ་འཐུན་པའོ།
en: This Dharma is compatible with the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: །ཆོས་འདི་ནི་འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་ཚད་མེད་པ་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་རྗེས་སུ་འཐུན་པའོ།
en: This Dharma is compatible with the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, and wishlessness.

source: །ཆོས་འདི་ནི་མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་དང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་མི་འཇིགས་པ་རྣམས་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་རྗེས་སུ་འཐུན་པའོ།
en: This Dharma is compatible with the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas.

source: །ཆོས་འདི་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དང་རྗེས་སུ་འཐུན་པའོ།
en: This Dharma is compatible with [the goals], up to and including all-aspect omniscience. “

source: །ཆོས་འདི་ནི་གང་ལ་ཡང་ཐོགས་པ་མ་མཆིས་པ་སྟེ།
en: Nowhere is this Dharma obstructed.

source: ཅི་ལ་ཐོགས་པ་མ་མཆིས་ཤེ་ན། གཟུགས་ལ་ཐོགས་པ་མ་མཆིས་སོ།
en: If you ask with regard to what it is unobstructed, it is unobstructed with regard to physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ལ་ཐོགས་པ་མ་མཆིས་སོ།
en: It is unobstructed with regard to feelings, perceptions, formative predispositions, and consciousness.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་ཐོགས་པ་མ་མཆིས་སོ།
en: It is unobstructed with regard to the sense fields, sensory elements, and links of dependent origination.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་ཐོགས་པ་མ་མཆིས་སོ།
en: It is unobstructed with regard to all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment.

source: །འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ལ་ཐོགས་པ་མ་མཆིས་སོ། །མངོན་པར་ཤེས་པ་རྣམས་དང་།
en: It is unobstructed with regard to the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, and wishlessness.

source: ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་།
en: It is unobstructed with regard to the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་ཐོགས་པ་མ་མཆིས་སོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་ཐོགས་པ་མ་མཆིས་སོ།
en: It is unobstructed with regard to [all the goals], up to and including all-aspect omniscience. “

source: །ཆོས་འདི་ནི་ནམ་མཁའ་མཉམ་པ་ཉིད་དང་དེ་བཞིན་ཉིད་མཉམ་པ་ཉིད་དང་ཆོས་ཀྱི་དབྱིངས་གནས་པ་མཉམ་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་མཉམ་པ་ཉིད་དང་བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མཉམ་པ་ཉིད་དང་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་མཉམ་པ་ཉིད་དང་། སྐྱེ་བ་མཆིས་པ་དང་།
en: This Dharma has the defining characteristic of not being obstructed, owing to its sameness with space, owing to its sameness with the real nature, owing to its sameness with the abiding realm of phenomena, owing to its sameness with the very limit of reality, owing to its sameness with the inconceivable realm, owing to its sameness with emptiness, signlessness, and wishlessness, owing to its sameness with nonarising and noncessation, and owing to its sameness with nonaffliction and nonpurification. “

source: འགག་པ་མ་མཆིས་པ་མཉམ་པ་ཉིད་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མ་མཆིས་པ་དང་། རྣམ་པར་བྱང་བ་མ་མཆིས་པ་མཉམ་པ་ཉིད་ཀྱི་སླད་དུ་ཐོགས་པ་མ་མཆིས་པའི་མཚན་ཉིད་དོ། །ཆོས་འདི་ནི་གཟུགས་ཀྱི་སྐྱེ་བ་མི་དམིགས་པ་དང་ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་སྐྱེ་བ་མི་དམིགས་པ་དང་། སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་སྐྱེ་བ་མི་དམིགས་པ་དང་ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་སུམ་ཅུ་རྩ་བདུན་གྱི་སྐྱེ་བ་མི་དམིགས་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་སྐྱེ་བ་མི་དམིགས་པ་དང་།
en: This Dharma is nonarising, owing to the nonapprehension of the arising of physical forms; owing to the nonapprehension of the arising of feelings, perceptions, formative predispositions, and consciousness; {Ki.

source: མངོན་པར་ཤེས་པ་དང་ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་དང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་སྐྱེ་བ་མི་དམིགས་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་སྐྱེ་བ་མི་དམིགས་པའི་སླད་དུ་སྐྱེ་བ་མ་མཆིས་པའོ། །ཆོས་འདི་ནི་གཟུགས་ཀྱི་རྟེན་མི་དམིགས་པ་དང་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་རྟེན་མི་དམིགས་པ་དང་སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་རྟེན་མི་དམིགས་པ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་རྟེན་མི་དམིགས་པ་དང་འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་ཚད་མེད་པ་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་།
en: IV: 120} owing to the nonapprehension of the arising of the sense fields, sensory elements, and links of dependent origination; owing to the nonapprehension of the arising of all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment; owing to the nonapprehension of the arising of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, and wishlessness; owing to the nonapprehension of the arising of the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas; and owing to the nonapprehension of the arising of [the goals], up to and including all-aspect omniscience. “

source: སྨོན་པ་མེད་པའི་རྟེན་མི་དམིགས་པ་དང་། མངོན་པར་ཤེས་པ་དང་ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་མི་འཇིགས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་རྟེན་མི་དམིགས་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་རྟེན་མི་དམིགས་པའི་སླད་དུ་རྟེན་མ་མཆིས་པའོ།
en: This Dharma is groundless, owing to the nonapprehension of the ground of physical forms; owing to the nonapprehension of the ground of feelings, perceptions, formative predispositions, and consciousness; owing to the nonapprehension of the ground of the sense fields, sensory elements, and links of dependent origination; owing to the nonapprehension of the ground of all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment; owing to the nonapprehension of the ground of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, and wishlessness; owing to the nonapprehension of the ground of the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas; and owing to the nonapprehension of the ground of [the goals], up to and including all-aspect omniscience.”

source: །དེ་ནས་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ཡོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་ཀྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །གནས་བརྟན་རབ་འབྱོར་འདི་ནི་བཅོམ་ལྡན་འདས་ཀྱི་རྗེས་སུ་སྐྱེས་སོ།
en: Then the gods inhabiting the realm of desire and those inhabiting the realm of form said to the Blessed One, “Blessed Lord, this elder Subhūti imitates the Blessed One.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལྟར་གནས་བརྟན་རབ་འབྱོར་ནི་ཅི་དང་ཅི་སྟོན་པ་དེ་ཐམས་ཅད་སྟོང་པ་ཉིད་བརྩམས་ཤིང་སྟོན་ཏོ།
en: If one were to ask why, it is because whatever the elder Subhūti is teaching, he teaches all phenomena commencing with emptiness.

source: མཚན་མ་མ་མཆིས་པ་དང་། སྨོན་པ་མ་མཆིས་པ་ཉིད་བརྩམས་ཤིང་སྟོན་ཏོ།
en: He teaches them commencing with signlessness and wishlessness.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ཡོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷའི་བུ་དག་གང་འདི་སྐད་དུ་བཅོམ་ལྡན་འདས་གནས་བརྟན་རབ་འབྱོར་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་སྐྱེས་སོ། །ཞེས་ཟེར་བ་ནི་ཇི་ལྟར་རྗེས་སུ་སྐྱེས་པས་གནས་བརྟན་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་སྐྱེས་པ་ཡིན་ཞེ་ན།
en: Then the venerable Subhūti addressed the gods inhabiting the realm of desire gods and those inhabiting the realm of form as follows: “Divine princes, with regard to your words, ‘Blessed Lord, this elder Subhūti imitates the Blessed One,’ if one were to ask in what manner of imitation the elder Subhūti imitates the Tathāgata, [this implies that] the elder Subhūti imitates the real nature of the Tathāgata.

source: གནས་བརྟན་རབ་འབྱོར་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་ཀྱི་རྗེས་སུ་སྐྱེས་པ་སྟེ། ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་མ་འོངས་མ་སོང་བ་དེ་བཞིན་དུ། གནས་བརྟན་རབ་འབྱོར་གྱི་དེ་བཞིན་ཉིད་ཀྱང་མ་འོངས་མ་སོང་པས་ན། ཐོག་མ་ནས་གནས་བརྟན་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་སྐྱེས་སོ།
en: Just as the real nature of the Tathāgata arises from nowhere, and departs nowhere, so the real nature of the elder Subhūti also arises from nowhere and departs nowhere, in which case the elder Subhūti has imitated the Tathāgata from the very beginning. “

source: །དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱང་དེའོ།
en: The real nature of the Tathāgata is also the real nature of all phenomena.

source: །ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་ཀྱང་དེ་སྟེ།
en: The real nature of all phenomena is also the real nature of the Tathāgata.

source: དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དེ་ཡང་དེ་བཞིན་ཉིད་མ་ཡིན་ནོ།
en: Yet, the real nature of the Tathāgata is without real nature.

source: །དེ་ལྟར་ན་གནས་བརྟན་རབ་འབྱོར་ནི་དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་སྐྱེས་སོ།
en: It is in this manner that the elder Subhūti imitates the Tathāgata.

source: །དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་དེ་བཞིན་དུ། གནས་བརྟན་རབ་འབྱོར་གནས་པས་དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་སྐྱེས་སོ།
en: Since the elder Subhūti dwells in accordance with the real nature of the Tathāgata, he does imitate the Tathāgata. “

source: །ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་པ་དེ་བཞིན་དུ་གནས་བརྟན་རབ་འབྱོར་གྱི་དེ་བཞིན་ཉིད་ཀྱང་འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་ལ།
en: Just as the real nature of the Tathāgata is unchanging and nonconceptual, in that same manner the real nature of the elder Subhūti is also unchanging and nonconceptual. “

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་ཅི་ལ་ཡང་ཐོགས་པ་མེད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱང་ཅི་ལ་ཡང་ཐོགས་པ་མེད་དེ། དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་།
en: Just as the real nature of the Tathāgata is unobstructed in all respects, in that same manner the real nature of all phenomena is also unobstructed in all respects.

source: ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་ཅིང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་ལ་དེ་བཞིན་ཉིད་དེ་ཡང་མ་བྱས་པ་སྟེ།
en: The real nature of the Tathāgata and the real nature of all phenomena are one and the same real nature. {Ki.IV: 121} They are not two things and cannot be divided into two. “This real nature is uncreated.

source: དེ་བཞིན་ཉིད་དེ་ནི་གང་གི་དེ་བཞིན་ཉིད་དུ་མ་གྱུར་པ་ཡང་མེད་དེ་དེ་བཞིན་ཉིད་དེ་ནི་གང་གི་དེ་བཞིན་ཉིད་དུ་མ་གྱུར་པ་ཡང་མེད་པ་དེའི་ཕྱིར་དེ་བཞིན་ཉིད་དེ་ནི་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་པ་སྟེ།
en: There is nothing at all of which it is not the real nature. Since there is nothing at all of which it is not the real nature, this real nature is not two things and cannot be divided into two.

source: དེ་ལྟར་ན་གནས་བརྟན་རབ་འབྱོར་ནི་དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་སྐྱེས་སོ།
en: So it is in this way that the elder Subhūti imitates the Tathāgata. “

source: །དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་ཐམས་ཅད་དུ་འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་པ་སྟེ། དེ་བཞིན་དུ་གནས་བརྟན་རབ་འབྱོར་གྱི་དེ་བཞིན་ཉིད་ཀྱང་ཐམས་ཅད་དུ་འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་ལ།
en: Just as the real nature of the Tathāgata is unchanging and nonconceptual in all respects, the real nature of the elder Subhūti is also unchanging and nonconceptual in all respects.

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་ཐ་མི་དད་པ། དབྱེར་མེད་པ་འབྱེད་པ་མ་ཡིན་པ་དམིགས་སུ་མེད་པ་དེ་བཞིན་དུ་གནས་བརྟན་རབ་འབྱོར་གྱི་དེ་བཞིན་ཉིད་ཀྱང་ཐ་མི་དད་པ་དབྱེར་མེད་པ། འབྱེད་པ་མ་ཡིན་པ་དམིགས་སུ་མེད་པ་སྟེ།
en: Just as the real nature of the Tathāgata is undifferentiated, indivisible, nondistinguishable, and nonapprehensible, in the same way the real nature of the elder Subhūti is also undifferentiated, indivisible, nondistinguishable, and nonapprehensible.

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དེ་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ལས་གུད་ན་ཡོད་པ་མ་ཡིན་ཏེ། དེ་ཡང་དེ་བཞིན་ཉིད་མ་ཡིན་པ་མ་ཡིན་ཞིང་རྟག་ཏུ་དེ་བཞིན་ཉིད་ཡིན་པ་དེ་བཞིན་དུ་གནས་བརྟན་རབ་འབྱོར་ཀྱང་རྣམ་པ་གཞན་མ་ཡིན་པར་དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་སྐྱེས་ཀྱང་གར་ཡང་རྗེས་སུ་སྐྱེས་པ་མེད་པ་སྟེ།
en: Just as the real nature of the Tathāgata is not distinct from the real nature of all phenomena, and is always the real nature, never not the real nature, in the same way the elder Subhūti, not being different, imitates the Tathāgata and yet he does not imitate anything at all.

source: །དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་སྐྱེས་སོ་ཞེས་བྱ་སྟེ།
en: It is said that he imitates the Tathāgata.

source: འདས་པའི་དེ་བཞིན་ཉིད་ཀྱི་མཉམ་པ་ཉིད་ཀྱིས། དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་མཉམ་པ་ཉིད་དོ།
en: That is to say, the real nature of the Tathāgata is sameness, owing to the sameness of the real nature of the past.

source: །དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་ཀྱི་མཉམ་པ་ཉིད་ཀྱིས་འདས་པའི་དེ་བཞིན་ཉིད་མཉམ་པ་ཉིད་དོ།
en: The real nature of the past is sameness, owing to the sameness of the real nature of the Tathāgata.

source: །མ་འོངས་པའི་དེ་བཞིན་ཉིད་ཀྱི་མཉམ་པ་ཉིད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་མཉམ་པ་ཉིད་དོ།
en: The real nature of the Tathāgata is sameness, owing to the sameness of the real nature of the future.

source: །དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་ཀྱི་མཉམ་པ་ཉིད་ཀྱིས་མ་འོངས་པའི་དེ་བཞིན་ཉིད་མཉམ་པ་ཉིད་དོ།
en: The real nature of the future is sameness, owing to the sameness of the real nature of the Tathāgata.

source: །ད་ལྟར་བྱུང་བའི་དེ་བཞིན་ཉིད་ཀྱི་མཉམ་པ་ཉིད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་མཉམ་པ་ཉིད་དོ།
en: The real nature of the Tathāgata is sameness, owing to the sameness of the real nature of the present.

source: །དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་ཀྱིས་མཉམ་པ་ཉིད་ཀྱིས། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་ཉིད་མཉམ་པ་ཉིད་དོ།
en: The real nature of the present is sameness, owing to the sameness of the real nature of the Tathāgata.

source: །དེ་ལྟར་ན་འདས་པ་དང་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བའི་དེ་བཞིན་ཉིད་དང་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དེ་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ།
en: So it is that the real nature of the past, the future, and the present, and the real nature of the Tathāgata, are one and the same real nature. They are not two things and cannot be divided into two. “

source: །གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the Tathāgata accords with the real nature of physical forms.

source: །དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་ཀྱིས་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of physical forms accords with the real nature of the Tathāgata.

source: །དེ་ལྟར་ན་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་དང་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དེ་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ།
en: So it is that the real nature of physical forms and the real nature of the Tathāgata are not two things and cannot be divided into two.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the Tathāgata accords with the real nature of feelings, perceptions, formative predispositions, and consciousness.

source: །དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་ཀྱིས་རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of consciousness [and so forth] accords with the real nature of the Tathāgata.

source: །དེ་ལྟར་ན་རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་དང་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དེ་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ།
en: So it is that the real nature of consciousness [and so forth], and the real nature of the Tathāgata, are not two things and cannot be divided into two.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་དེ་བཞིན་ཉིད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the Tathāgata accords with the real nature of the sense fields, sensory elements, and links of dependent origination.

source: །དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་ཀྱིས་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་དེ་བཞིན་ཉིད་དེ་དེ་ལྟར་ན་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་དེ་བཞིན་ཉིད་དང་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དེ་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ།
en: The real nature of the links of dependent origination [and so forth] accords with the real nature of the Tathāgata. So it is that the real nature of the links of dependent origination [and so forth], and the real nature of the Tathāgata, are not two things and cannot be divided into two. {Ki.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་དེ་བཞིན་ཉིད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དོ།
en: IV: 122} “The real nature of the Tathāgata accords with the real nature of the perfection of generosity.

source: །དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་ཀྱིས་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་དེ་བཞིན་ཉིད་དེ་དེ་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་དེ་བཞིན་ཉིད་དང་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དེ་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ།
en: The real nature of the perfection of generosity accords with the real nature of the Tathāgata. So it is that the real nature of the perfection of generosity and the real nature of the Tathāgata are not two things and cannot be divided into two.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་དེ་བཞིན་ཉིད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the Tathāgata accords with the real nature of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.
